# Homework 3 (40 pts)


Due Date: 11/12/2020 (Thursday 11:59 AM

Save Notebook file as :HW2_YourStudentID.ipynb

Upload to your Github and email the link to: jzhang@eastwest.edu

Subject: Homework 3 by YourStudentID and your name

In [30]:
%matplotlib inline
import pandas as pd

In [31]:
# limiting the display rows
pd.set_option('display.max_rows', 5)

In [32]:
data = pd.read_csv('data//MarchSales.csv')

In [33]:
sales = pd.read_csv('data/MarchSales.csv')
print(sales.shape)
sales

(107, 10)

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
0,2018-001,KRM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,2788
1,2018-002,RKM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,3245
...,...,...,...,...,...,...,...,...,...,...
105,2018-102,MAP,Chantalle,Desmarais,3/31/2018,Bedroom,Mattress,Paid in Full,Promotion,2000
106,2018-103,KRM,Sebastian,Gruenewald,3/31/2018,Living Room,End Tables,Finance,Standard,2505

In [9]:
print('Alejandro Blancas 20319\n')

# Problem 1. (2 pt)

# Show the number of rows and columns in sales dataframe.
print(sales.shape)
print(sales)

Alejandro Blancas 20319

(107, 10)
     Trans_No Operator Sales_First  Sales_Last       Date   Department  \
0    2018-001      KRM   Sebastian  Gruenewald   3/1/2018      Bedroom
1    2018-002      RKM   Sebastian  Gruenewald   3/1/2018      Bedroom
..        ...      ...         ...         ...        ...          ...
105  2018-102      MAP   Chantalle   Desmarais  3/31/2018      Bedroom
106  2018-103      KRM   Sebastian  Gruenewald  3/31/2018  Living Room

      Furniture      Pay_Type Trans_Type  Amount
0      Mattress       Finance  Promotion    2788
1      Mattress       Finance  Promotion    3245
..          ...           ...        ...     ...
105    Mattress  Paid in Full  Promotion    2000
106  End Tables       Finance   Standard    2505

[107 rows x 10 columns]

In [15]:
print('Alejandro Blancas 20319\n')

# Problem 2 (2 pt)

# show the column names of the datafram 
names = data.columns
print(names)
print('----------------------------------------\n')
# show the index of the datafram 
data.index

Alejandro Blancas 20319

Index(['Trans_No', 'Operator', 'Sales_First', 'Sales_Last', 'Date',
       'Department', 'Furniture', 'Pay_Type', 'Trans_Type', 'Amount'],
      dtype='object')
----------------------------------------

RangeIndex(start=0, stop=107, step=1)

In [16]:
print('Alejandro Blancas 20319\n')

# Problem 3 (2 pt)
# Only show Trans number
name = data['Trans_No']
print(name)

Alejandro Blancas 20319

0      2018-001
1      2018-002
         ...
105    2018-102
106    2018-103
Name: Trans_No, Length: 107, dtype: object

In [12]:
print('Alejandro Blancas 20319')

# Problem 4 (4 pt)
# Show Department without duplicate
department = data.Department.unique()
# Display department name as following format
print('Department')
print('---------------------------------------------')
for name in department:
    print(name)

Alejandro Blancas 20319
Department
---------------------------------------------
Bedroom
Living Room
Appliances
Dining Room

In [14]:
print('Alejandro Blancas 20319')

# Problem 5 (2 pt)
# Show the columns: Trans_No, Sales Representatives Name.
res = data[['Trans_No', 'Sales_First', 'Sales_Last']]
res

Alejandro Blancas 20319

     Trans_No Sales_First  Sales_Last
0    2018-001   Sebastian  Gruenewald
1    2018-002   Sebastian  Gruenewald
..        ...         ...         ...
105  2018-102   Chantalle   Desmarais
106  2018-103   Sebastian  Gruenewald

[107 rows x 3 columns]

In [17]:
print('Alejandro Blancas 20319\n')

# Problem 6 (2 pt)
# Show the columns: Trans_No, Sales Representatives Name. 
# (only show the first, third and fifth row)
# Hint: use .loc
res = data[['Trans_No','Sales_First','Sales_Last']].loc[[0,2,4]]
res

Alejandro Blancas 20319

   Trans_No Sales_First  Sales_Last
0  2018-001   Sebastian  Gruenewald
2  2018-003        Jade   Gallagher
4  2018-005        Jade   Gallagher

In [22]:
print('Alejandro Blancas 20319\n')

# Problem 7 (2 pt)
# Show all transactions in the department of Living Room
data[data['Department']=='Living Room'][['Trans_Type','Department','Amount']]

Alejandro Blancas 20319

    Trans_Type   Department  Amount
2    Promotion  Living Room   10000
3    Promotion  Living Room    1000
..         ...          ...     ...
98    Standard  Living Room   14275
106   Standard  Living Room    2505

[26 rows x 3 columns]

In [47]:
print('Alejandro Blancas 20319\n')

# Problem 8 (2 pts)
# Show all transaction in Living Room Department and Trans_Type is Promotion
data[(data['Trans_Type']=='Promotion') & (data['Department']=='Living Room')]

Alejandro Blancas 20319

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
2,2018-003,MAP,Jade,Gallagher,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,10000
3,2018-004,MAP,Jade,Gallagher,3/1/2018,Living Room,End Tables,Finance,Promotion,1000
...,...,...,...,...,...,...,...,...,...,...
73,2018-070,KRM,Ambrose,Sardelis,3/23/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,12500
77,2018-074,MAP,Jade,Gallagher,3/24/2018,Living Room,Loveseat,Paid in Full,Promotion,1255

In [50]:
print('Alejandro Blancas 20319')

# Problem 9 (2 pts)
# Show all transaction which amount is over 10000 or Pay_Type is Finance

res = data[(data['Pay_Type']=='Finance') & (data.Amount > 10000)]
res

Alejandro Blancas 20319

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
5,2018-006,COK,Ambrose,Sardelis,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,12000
6,2018-006,COK,Ambrose,Sardelis,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,12000
...,...,...,...,...,...,...,...,...,...,...
100,2018-097,COK,Sebastian,Gruenewald,3/29/2018,Bedroom,Bedroom Furniture Set,Finance,Standard,14321
103,2018-100,COK,Chantalle,Desmarais,3/30/2018,Bedroom,Bedroom Furniture Set,Finance,Promotion,11234

In [53]:
print('Alejandro Blancas 20319')

# Problem 10 (2 pts)
# Show all transaction which amount is over 10000
# Only include columns: Trans_No, Furniture,Pay_Type, Amount

res = data[(data['Pay_Type']=='Finance') & (data.Amount > 10000)][['Trans_No','Furniture','Pay_Type','Amount']]
res

Alejandro Blancas 20319

     Trans_No                      Furniture Pay_Type  Amount
5    2018-006  Sofa, Loveseat, Chair Package  Finance   12000
6    2018-006  Sofa, Loveseat, Chair Package  Finance   12000
..        ...                            ...      ...     ...
100  2018-097          Bedroom Furniture Set  Finance   14321
103  2018-100          Bedroom Furniture Set  Finance   11234

[10 rows x 4 columns]

In [54]:
print('Alejandro Blancas 20319')

# Problem 11 ( 2 pt)
# Show the all transactions by Ambrose Sardelis
data.Sales_First=='Ambrose'

data[data.Sales_First=='Ambrose']

Alejandro Blancas 20319

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
5,2018-006,COK,Ambrose,Sardelis,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,12000
6,2018-006,COK,Ambrose,Sardelis,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,12000
...,...,...,...,...,...,...,...,...,...,...
96,2018-093,MAP,Ambrose,Sardelis,3/28/2018,Bedroom,Mattress,Paid in Full,Standard,2000
97,2018-094,MAP,Ambrose,Sardelis,3/28/2018,Bedroom,Mattress,Paid in Full,Promotion,3245

In [60]:
print('Alejandro Blancas 20319')

# Problem 12 ( 2 pt)
 
# Show the number of transactions by Ambrose Sardelis

transactions = data[data.Sales_First=='Ambrose'].Sales_First.count()
print('Number of tranactions by Ambrose Sarelis: ',transactions)

Alejandro Blancas 20319
Number of tranactions by Ambrose Sarelis:  24

In [63]:
print('Alejandro Blancas 20319')

# Problem 13 ( 2 pt)
 
# Show the total sales by Ambrose Sardelis

total_sales = data[data.Sales_First=='Ambrose'].Amount.sum()
print('Total sales of transaction by Ambrose Sardelis: $', total_sales)

Alejandro Blancas 20319
Total sales of transaction by Ambrose Sardelis: $ 131899

In [82]:
print('Alejandro Blancas 20319')

# Problem 14 (2 pt)
# Show the total sales amount in March.
#data.describe()
total_sales = data['Amount'].sum()
print('Total Sales: $',total_sales)

Alejandro Blancas 20319
Total Sales: $ 493887

In [98]:
print('Alejandro Blancas 20319\n')

# Problem 15 & 16 ( 4 pts)
# What the percentage of sales transactions in Promotion type among all sales transaction.

total_trans = data['Trans_No'].count()
num_sales = data[data.Trans_Type=='Promotion'].Trans_Type.count()
a_num = num_sales/total_trans
percentage = "{:.2%}".format(a_num)

print('Total transaction number: ', total_trans)
print('Number of sales transactions in Promotion: ', num_sales)
print('Percentage of sales transactions: ',percentage)

Alejandro Blancas 20319

Total transaction number:  107
Number of sales transactions in Promotion:  52
Percentage of sales transactions:  48.60%

In [103]:
print('Alejandro Blancas 20319\n')

# Problem 16 & 17 ( 4 pts)
# What the percentage of total sales from living room department among total sales.

total_sales = data['Amount'].sum()
num_sales = data[data.Department=='Living Room'].Amount.sum()
a_num = num_sales/total_sales
percentage = "{:.2%}".format(a_num)

print('March total sales: $',total_sales)
print('Living room department total sales: $',num_sales)
print('Percentage of total sales: ',percentage)

Alejandro Blancas 20319

March total sales: $ 493887
Living room department total sales: $ 155323
Percentage of total sales:  31.45%

In [112]:
print('Alejandro Blancas 20319\n')

# Problem 18 ( 2 pt)
# Show sales Amount from Bedroom and living room department. ( hint: Use OR Logic)

total_sales = data[(data['Department'] =='Bedroom') | (data['Department'] =='Living Room') ].Amount.sum()
print('Total Sales by Bedroom and Living Room departments: $',total_sales)

Alejandro Blancas 20319

Total Sales by Bedroom and Living Room departments: $ 282018

In [114]:
print('Alejandro Blancas 20319\n')

# Problem 19 ( 2 pt)
# Show the number of sales transactions from Bedroom department and Living Room department.
#  ( hint: Use OR Logic)

total_sales = data[(data['Department'] =='Bedroom') | (data['Department'] =='Living Room') ].Amount.count()
print(total_sales)

Alejandro Blancas 20319

50